<a href="https://colab.research.google.com/github/jethompson023/CS-491/blob/main/CS491Assignment3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np 
import pandas as pd

In [ ]:
df = pd.DataFrame({'date': ['2017-06-05', '2017-06-06', '2017-06-07', '2017-06-08', '2017-06-09'],
      'Facebook_Price': [155,150,153,155,156],
      'Google_Price': [955, 987, 963, 1000, 1012], 
      'Mircosoft_Price': [66,69,62, 61, 66], 
      'Facebook_PE': [37.10, 36.98, 36.78 , 36.11, 37.07],
      'Google_PE': [32.0, 31.3, 31.7, 31.2, 30.0],
      'Mircosoft_PE': [30.31, 30.56, 30.46, 30.11, 31.00]})
df

         date  Facebook_Price  ...  Google_PE  Mircosoft_PE
0  2017-06-05             155  ...       32.0         30.31
1  2017-06-06             150  ...       31.3         30.56
2  2017-06-07             153  ...       31.7         30.46
3  2017-06-08             155  ...       31.2         30.11
4  2017-06-09             156  ...       30.0         31.00

[5 rows x 7 columns]

Q2. Set the index to be the date. Then show the information for each date and each company. Example output (shows just the first row):

In [ ]:
df.set_index('date')

            Facebook_Price  Google_Price  ...  Google_PE  Mircosoft_PE
date                                      ...
2017-06-05             155           955  ...       32.0         30.31
2017-06-06             150           987  ...       31.3         30.56
2017-06-07             153           963  ...       31.7         30.46
2017-06-08             155          1000  ...       31.2         30.11
2017-06-09             156          1012  ...       30.0         31.00

[5 rows x 6 columns]

In [ ]:
tdf = df.loc[0]
new_df = pd.DataFrame(tdf)
new_df

                          0
date             2017-06-05
Facebook_Price          155
Google_Price            955
Mircosoft_Price          66
Facebook_PE            37.1
Google_PE                32
Mircosoft_PE          30.31

Q3. Use the result from Q1 to find the average price and average P/E ratio per stock name.

In [ ]:
mean = df.mean(axis=0)
mean

Facebook_Price     153.800
Google_Price       983.400
Mircosoft_Price     64.800
Facebook_PE         36.808
Google_PE           31.240
Mircosoft_PE        30.488
dtype: float64

Q4. Consider a scenario where John is 20, Bob is 30, and Suzan is 22. Suppose that there are three courses: CS 233, CS 455, and ENGL 433. Next, suppose that John took CS 233 and got a C, took CS 455 and got a B, and Suzan took ENGL 433 and got an A. Create three data frames. The student data frame should store the student name and age. The course data frame should store the department, course number, and description. Finally, the takes data frame should store the department name, course number, and grade. You can assume that each student has unique name.

In [ ]:
student = pd.DataFrame({'name':['John', 'Bob', 'Suzan'],
                        'age':[20, 30, 22]})
display(student)

course = pd.DataFrame({'department':['CS', 'CS', 'ENGL'],
                        'Course Number':[233, 455, 433]})
display(course)

takes = pd.DataFrame({'department':['CS', 'CS', 'ENGL'],
                        'Course Number':[233, 455, 433],
                        'Grade':['C', 'B', 'A']})
display(takes)

    name  age
0   John   20
1    Bob   30
2  Suzan   22

  department  Course Number
0         CS            233
1         CS            455
2       ENGL            433

  department  Course Number Grade
0         CS            233     C
1         CS            455     B
2       ENGL            433     A

Q5. Write code that finds the GPA of each student. The value should be 0 if the student has taken no classes.

In [ ]:
frames = [student, takes]
findGPA = pd.concat(frames, axis =1)
grades = findGPA[['Grade']].iloc[0:3]
gpa_value = []
findGPA

    name  age department  Course Number Grade
0   John   20         CS            233     C
1    Bob   30         CS            455     B
2  Suzan   22       ENGL            433     A

In [ ]:
def calcGPA(grades):
  if grades =='A':
    print(4.0)
  elif grades == 'B':
    print(3.0)
  elif grades <='C': 
    print(2.0)
  else:
    print(0.0)
  print(grade)

NameError: ignored

Q6. Write code that prints the names of students that have taken no classes.

Q7. Create a Series. The index should be all the business days in 2018. The values should be the numbers from 0 to 260.

In [ ]:
import pandas as pd
dt = pd.to_datetime('2018-01-01')
myIndex = date + pd.to_datetime(np.arange(12), 'D')*30
pd.Series(np.arange(12), index= myIndex)

AssertionError: ignored

Q8. Create a data frame that contains the number of Mondays, Tuesday, ... , Sundays in 2018. You should compute the result using the pandas library.

In [ ]:
date = pd.to_datetime('2018-01-01')
myIndex = date + pd.to_delta(np.arange(12), 'D')*30
myIndex-myIndex[0]

AttributeError: ignored

Q9. Which day of the week (e.g., Monday, Tuesday?) is most profitable for the GOOG stock in 2017? Compute the difference between the opening and closing price for each day of the week and sum over the whole year.  Expected output:

In [ ]:
%matplotlib inline
import matplotlib.pyplot as plt
goog = data.DataReader('GOOG', 'yahoo', start= '2015', end= '2021')
goog

                   High          Low  ...     Volume    Adj Close
Date                                  ...
2015-01-02   529.815369   522.665039  ...  1447563.0   523.373108
2015-01-05   522.894409   511.655243  ...  2059840.0   512.463013
2015-01-06   514.761719   499.678131  ...  2899940.0   500.585632
2015-01-07   505.855164   498.281952  ...  2065054.0   499.727997
2015-01-08   502.101471   489.655640  ...  3353582.0   501.303680
...                 ...          ...  ...        ...          ...
2020-12-24  1746.000000  1729.109985  ...   346800.0  1738.849976
2020-12-28  1790.728027  1746.334961  ...  1393000.0  1776.089966
2020-12-29  1792.439941  1756.089966  ...  1299400.0  1758.719971
2020-12-30  1765.094971  1725.599976  ...  1306100.0  1739.520020
2020-12-31  1758.930054  1735.420044  ...  1011900.0  1751.880005

[1511 rows x 6 columns]

In [ ]:
from pandas_datareader import data

goog = data.DataReader('GOOG', 'yahoo', start = '2017', end= '2018')
goog['Profit']=goog['Close']-goog['Open']
goog = goog.reset_index()
goog['DOW']=goog['Date'].transform(lambda x: x.strftime('%A'))
result = goog.groupby('DOW')['Profit'].sum()
pd.DataFrame(result,columns=['Profit']).sort_values('Profit', ascending=False)

              Profit
DOW
Wednesday  77.895081
Tuesday    42.460205
Monday     38.770020
Thursday    5.105225
Friday      1.340271